# -*- coding: utf-8 -*-

'''ЗАДАЧА: КЛАССЫ Employee и ProductionWorker
[Начинаем программировать на Python. Тони Гэддис (2022)]
Напишите класс Employee (Сотрудник), который содержит атрибуты приведенных ниже
данных:
    - имя сотрудника;
    - номер сотрудника.
Затем напишите класс ProductionWorker (Рабочий), который является подклассом
класса Employee. Класс ProductionWorker должен содержать атрибуты приведенных
ниже данных:
    - номер смены(целое число, к примеру, 1 или 2);
    - ставка почасовой оплаты труда.
Рабочий день разделен на две смены: дневную и вечернюю. Атрибут смены будет
содержать целочисленное значение, представляющее смену, в которую сотрудник
работает. Дневная смена является сменой 1, вечерняя смена - сменой 2.
Напишите соответствующие методы-получатели и методы мутаторы для каждого класса.

Затем напишите программу, которая создает объект класса ProductionWorker и
предлагает пользователю ввестиданные по каждому атрибуту данных этого
объекта. Сохраните данные в объекте и примените в этом объекте
методы-получатели, чтобы получить эти данные и вывести их на экран.
'''

