# -*- coding: utf-8 -*-

'''ЗАДАЧА: КОНВЕРТЕР АЗБУКИ МОРЗЕ
[Начинаем программировать на Python. Тони Гэддис (2022)]

Азбука Морзе представляет собой кодировку, где каждая буква алфавита, каждая
цифра и различные знаки препинания представлены серией точек и тире.

Напишите программу, которая просит пользователя ввести строковое значение и
затем преобразует это строковое значение в кодировку азбукой Морзе.
'''

def character_to_morse_code(symb):
    morse_code = {
        ' ' : ' ',
        ',' : '--..--',
        '.' : '.-.-.-',
        '?' : '..--..',
        '0' : '-----',
        '1' : '.----',
        '2' : '..---',
        '3' : '...--',
        '4' : '....-',
        '5' : '.....',
        '6' : '-....',
        '7' : '--...',
        '8' : '---..',
        '9' : '----.',
        'A' : '.-',
        'B' : '-...',
        'C' : '-.-.',
        'D' : '-..',
        'E' : '.',
        'F' : '..-.',
        'G' : '--.',
        'H' : '...',
        'I' : '..',
        'J' : '.---',
        'K' : '-.-',
        'L' : '.-..',
        'M' : '--',
        'N' : '-.',
        'O' : '---',
        'P' : '.--.',
        'Q' : '--.-',
        'R' : '.-.',
        'S' : '...',
        'T' : '-',
        'U' : '..-',
        'V' : '...-',
        'W' : '.--',
        'X' : '-..-',
        'Y' : '-.-',
        'Z' : '--..',
        'А' : '.-',
        'Б' : '-...',
        'В' : '.--',
        'Г' : '--.',
        'Д' : '-..',
        'Е' : '.',
        'Ж' : '...-',
        'З' : '--..',
        'И' : '..',
        'Й' : '.---',
        'К' : '-.-',
        'Л' : '.-..',
        'М' : '--',
        'Н' : '-.',
        'О' : '---',
        'П' : '.--.',
        'Р' : '.-.',
        'С' : '...',
        'Т' : '-',
        'У' : '..-',
        'Ф' : '..-.',
        'Х' : '....',
        'Ц' : '-.-.',
        'Ч' : '---.',
        'Ш' : '----',
        'Щ' : '--.-',
        'Ъ' : '.--.-.',
        'Ы' : '-.--',
        'Ь' : '-..-',
        'Э' : '..-..',
        'Ю' : '..--',
        'Я' : '.-.-'
    }
    return morse_code.get(symb, '?')

def main():
    s = input('Enter your message: ')
    print('Your message is encoded in Morse code:')
    for symb in s:
        print(character_to_morse_code(symb.upper()), ' ', end='')
    print()

if __name__ == '__main__':
    main()
