# -*- coding: utf-8 -*-

'''ЗАДАЧА: КАЛЬКУЛЯТОР МИЛЬ НА ГАЛЛОН БЕНЗИНА
[Начинаем программировать на Python. Тони Гэддис (2022)]
Напишите программу с GUI, которая вычисляет экономичность автомобиля. Окно
программы должно содержать виджеты Entry, которые позволяют пользователю
вводить объем бензина в галлонах, заправленного в автомобиль, и число миль,
которые он может пройти с полным баком. При нажатии кнопки "Вычислить MPG"
программа должна вывести на экран число миль, которые автомобиль может пройти в
расчете на галлон бензина. Для вычисления показателя числа миль на галлон
примените приведенную ниже формулу:

    Показатель миль на галлон = мили / галлоны
'''
