# -*- coding: utf-8 -*-

'''ЗАДАЧА: РАСХОДЫ НА ЛЕЧЕНИЕ
[Начинаем программировать на Python. Тони Гэддис (2022)]

Напишите класс под название Patient (Пациент), который имеет атрибуты для
приведенных ниже данных:
    - имя, отчество и фамилия;
    - адрес, город, область и почтовый индекс;
    - телефонный номер;
    - имя и телефон контактного лица для экстренной связи.

Метод __init__() класса Patient должен принимать аргумент для каждого
атрибута. Класс Patient также должен для каждого атрибута иметь
методы-мутаторы.

Затем напишите класс Procedure, который представляет пройденную пациентом
медицинскую процедура. Класс Procedure должен иметь атрибуты для приведенных
ниже данных:
'''